Author:Nutan Mandale

Mentor:Vincent Ramdhanie

### Question

Which clustering solution is best for Boston Marathon Data?

In [2]:

import numpy as np
import pandas as pd
import scipy
import matplotlib.pyplot as plt
import seaborn as sns
import mglearn

from time import time
from IPython.display import display
from sklearn.cluster import KMeans
from sklearn.datasets.samples_generator import make_blobs
from sklearn.model_selection import train_test_split
from sklearn.cluster import MeanShift, estimate_bandwidth
from sklearn.cluster import SpectralClustering
from sklearn.cluster import AffinityPropagation
from sklearn import metrics
from sklearn.preprocessing import normalize

%matplotlib inline

In [16]:
#import data
data = pd.read_csv('./results.csv')

In [17]:
data.shape

(31984, 21)

In [18]:
data.head(2)

,10k,name,division,25k,gender,age,official,bib,genderdiv,ctz,...,overall,pace,state,30k,5k,half,20k,country,city,40k
0,17.37,"Yamamoto, Hiroyuki",8,47.67,M,47,85.25,W1,8,NaN,...,8,3.27,NaN,59.18,8.02,39.72,37.65,JPN,Fukuoka,80.43
1,32.58,"Jeptoo, Rita",1,82.43,F,33,138.95,F1,1,NaN,...,21,5.30,NaN,99.33,16.22,69.47,65.83,KEN,Eldoret,132.10

In [19]:
data.columns

Index(['10k', 'name', 'division', '25k', 'gender', 'age', 'official', 'bib',
       'genderdiv', 'ctz', '35k', 'overall', 'pace', 'state', '30k', '5k',
       'half', '20k', 'country', 'city', '40k'],
      dtype='object')

In [20]:
print(data.isnull().sum())

10k              0
name             0
division         0
25k              0
gender           0
age              0
official         0
bib              0
genderdiv        0
ctz          30740
35k              0
overall          0
pace             0
state         2576
30k              0
5k               0
half             0
20k              0
country          0
city             1
40k              0
dtype: int64

In [21]:
#data = data.dropna()

In [22]:
data.describe()

,division,age,official,genderdiv,overall,pace
count,31984.000000,31984.000000,31984.000000,31984.000000,31984.000000,31984.000000
mean,1932.563032,42.407079,242.997314,8051.044741,15939.587825,9.275658
std,1715.228694,11.316496,52.300431,4754.005626,9232.978224,1.992486
min,1.000000,18.000000,80.600000,1.000000,1.000000,3.080000
25%,610.000000,33.000000,205.527500,3972.000000,7943.750000,7.850000
50%,1425.000000,42.000000,232.370000,7970.000000,15939.500000,8.870000
75%,2611.000000,50.000000,273.235000,11968.000000,23935.250000,10.430000
max,6979.000000,81.000000,538.880000,17575.000000,31931.000000,20.570000

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31984 entries, 0 to 31983
Data columns (total 21 columns):
10k          31934 non-null float64
name         31984 non-null object
division     31984 non-null int64
25k          31768 non-null float64
gender       31984 non-null object
age          31984 non-null int64
official     31984 non-null float64
bib          31984 non-null object
genderdiv    31984 non-null int64
ctz          1244 non-null object
35k          31950 non-null float64
overall      31984 non-null int64
pace         31984 non-null float64
state        29408 non-null object
30k          31944 non-null float64
5k           31932 non-null float64
half         31912 non-null object
20k          31933 non-null float64
country      31984 non-null object
city         31983 non-null object
40k          31945 non-null float64
dtypes: float64(9), int64(4), object(8)
memory usage: 5.1+ MB

In [37]:
#converting data-type to float
data = data.replace(to_replace='-', value=np.nan)
data['5k'] = data['5k'].astype(float)
data['10k'] = data['10k'].astype(float)
data['20k'] = data['20k'].astype(float)
data['25k'] = data['25k'].astype(float)
data['35k'] = data['35k'].astype(float)
data['30k'] = data['30k'].astype(float)
data['40k'] = data['40k'].astype(float)
data['half'] = data['half'].astype(float)

In [38]:
data.country.unique()

array(['JPN', 'KEN', 'RSA', 'ETH', 'SUI', 'USA', 'FRA', 'CAN', 'ESP',
       'POL', 'RUS', 'BLR', 'MAR', 'UKR', 'BRA', 'THA', 'CHN', 'ITA',
       'GER', 'GBR', 'AUS', 'SWE', 'GRE', 'SLO', 'IRL', 'KOR', 'ARG',
       'COL', 'NED', 'ISR', 'CZE', 'NOR', 'AUT', 'CRC', 'MEX', 'GUA',
       'SIN', 'DEN', 'HUN', 'BEL', 'FIN', 'CHI', 'ISL', 'VEN', 'DOM',
       'PER', 'HKG', 'SVK', 'NZL', 'TPE', 'PHI', 'CAY', 'POR', 'UAE',
       'IND', 'PAN', 'ROU', 'LUX', 'ESA', 'TRI', 'MAS', 'VGB', 'EGY',
       'BRN', 'EST', 'ECU', 'LIE', 'TUR', 'BOL', 'BAR', 'URU', 'QAT',
       'INA', 'BER', 'TAN', 'BAH', 'CRO', 'ZIM'], dtype=object)

In [39]:
country_count = len(data.country.unique())
print(country_count)

78

In [40]:
data.gender.unique()

array(['M', 'F'], dtype=object)

In [41]:
data['gender'] = data['gender'].apply(lambda x: 1 if x == 'M' else 0)

In [44]:
X = data[['5k','10k','20k','25k','30k','35k','40k','half','division','age','gender','pace']]

In [45]:
X.head(2)

,5k,10k,20k,25k,30k,35k,40k,half,division,age,gender,pace
0,8.02,17.37,37.65,47.67,59.18,71.40,80.43,39.72,8,47,1,3.27
1,16.22,32.58,65.83,82.43,99.33,116.37,132.10,69.47,1,33,0,5.30

In [46]:
print(X.isnull().sum())

5k           52
10k          50
20k          51
25k         216
30k          40
35k          34
40k          39
half         72
division      0
age           0
gender        0
pace          0
dtype: int64

In [48]:
X = X.dropna()